In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [11]:
index= [1,2,3]
names = ['Nourah', 'Sarah', 'Ahmed']
s1 = pd.Series(names, index=index)
s1

1    Nourah
2     Sarah
3     Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [12]:
s1.index=[11,12,13]
s1

11    Nourah
12     Sarah
13     Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [19]:
print(s1[11], ' ', s1[12])

# second way
print(s1[0:2])

Nourah   Sarah
11    Nourah
12     Sarah
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [42]:
s2 = pd.Series(['Sarah'])
z = pd.concat([s1, s2])
# OR
# z = pd.concat([s1, s2],ignore_index=True)
z=z.drop_duplicates()
z

11    Nourah
12     Sarah
13     Ahmed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [28]:
data = {'ID': ['1111', '2222', '3333'],
        'Name': ['Nourah', 'Sarah', 'Ahmed'],
        'GPA': [4.5, 3.3, 4.5]
       } 
students = pd.DataFrame(data, columns=['ID', 'Name', 'GPA'])
students

     ID    Name  GPA
0  1111  Nourah  4.5
1  2222   Sarah  3.3
2  3333   Ahmed  4.5

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [31]:
read = pd.read_csv('educ_figdp_1_Data.csv')
read.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [48]:
# slice
read[0:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [49]:
# loc
read.loc[0:3]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e

In [50]:
# loc
read.loc[0:3,['TIME', 'GEO']]
# difference
# in loc the last index is included however in slice it is not
# in loc we can specify the columns however in slice we can not

   TIME                            GEO
0  2000  European Union (28 countries)
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)